Indicates if the filter has an ElementId value.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool IsElementIdValue { get; }
  Visual Basic
Public ReadOnly Property IsElementIdValue As Boolean
	Get
  Visual C++
public:
property bool IsElementIdValue {
	bool get ();
}
 See Also
  ScheduleFilter Class
  Autodesk.Revit.DB Namespace